-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 17 2022 г., 16:08
-- Версия сервера: 8.0.24
-- Версия PHP: 7.4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `ordersdb`
--

-- --------------------------------------------------------

--
-- Структура таблицы `doctrine_migration_versions`
--

CREATE TABLE `doctrine_migration_versions` (
  `version` varchar(191) COLLATE utf8_unicode_ci NOT NULL,
  `executed_at` datetime DEFAULT NULL,
  `execution_time` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `doctrine_migration_versions`
--

INSERT INTO `doctrine_migration_versions` (`version`, `executed_at`, `execution_time`) VALUES
('DoctrineMigrations\\Version20220206133435', '2022-02-06 16:36:08', 51),
('DoctrineMigrations\\Version20220222034145', '2022-04-02 19:20:41', 74),
('DoctrineMigrations\\Version20220222034305', '2022-04-02 19:21:12', 69),
('DoctrineMigrations\\Version20220410162455', '2022-04-10 19:28:16', 515),
('DoctrineMigrations\\Version20220425082009', '2022-04-25 11:35:40', 60);

-- --------------------------------------------------------

--
-- Структура таблицы `order`
--

CREATE TABLE `order` (
  `id` int NOT NULL,
  `order_number` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `order_date` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `order_wording` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `student_id` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `order`
--

INSERT INTO `order` (`id`, `order_number`, `order_date`, `order_wording`, `student_id`) VALUES
(2, '32131', '2022-04-08', 'На зачисление', 33),
(3, '145-2п', '2022-04-26', 'На отчисление', 33),
(4, '147_ва', '2022-04-26', 'На зачисление стипендии', 33),
(5, '99078', '2032-08-26', 'На зачисление стипендии', 37),
(6, '145-2п', '2022-04-13', 'На отчисление', 140),
(7, '145-2п', '2022-04-16', 'На отчисление', 59),
(8, '1505500', '2022-04-30', 'На зачисление стипендии', 88),
(9, '13', '2022-05-24', 'На отчисление', 33);

-- --------------------------------------------------------

--
-- Структура таблицы `student`
--

CREATE TABLE `student` (
  `id` int NOT NULL,
  `first_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `group_number` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `course` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `student`
--

INSERT INTO `student` (`id`, `first_name`, `last_name`, `group_number`, `course`) VALUES
(33, 'Даниил', 'Агапов', 'MT-101', 1),
(34, 'Яна', 'Агафонова', 'MT-101', 1),
(35, 'Виктория', 'Агафонова', 'MT-101', 1),
(36, 'Александра', 'Алексеева', 'MT-101', 1),
(37, 'Варвара', 'Алексеева', 'MT-101', 1),
(38, 'Маргарита', 'Андреева', 'MT-101', 1),
(39, 'Диана', 'Андреева', 'MT-101', 1),
(40, 'Алёна', 'Аникина', 'MT-101', 1),
(41, 'Андрей', 'Антонов', 'MT-101', 1),
(42, 'Тимофей', 'Антонов', 'MT-101', 1),
(43, 'Екатерина', 'Афанасьева', 'MT-101', 1),
(44, 'Тимур', 'Баженов', 'MT-101', 1),
(45, 'Дарья', 'Безрукова', 'MT-101', 1),
(46, 'Варвара', 'Белова', 'MT-101', 1),
(47, 'Максим', 'Белоусов', 'MT-101', 1),
(48, 'Даниил', 'Беляев', 'MT-101', 1),
(49, 'Тимур', 'Беляев', 'MT-101', 1),
(50, 'Ярослав', 'Бобров', 'MT-101', 1),
(51, 'Лев', 'Богданов', 'MT-101', 1),
(52, 'София', 'Богданова', 'MT-101', 1),
(53, 'Карина', 'Богданова', 'MT-101', 1),
(54, 'Денис', 'Болдырев', 'MT-101', 1),
(55, 'Максим', 'Борисов', 'MT-101', 1),
(56, 'Василиса', 'Борисова', 'MT-101', 1),
(57, 'Виктория', 'Бочарова', 'MT-101', 1),
(58, 'Максим', 'Васильев', 'MT-101', 1),
(59, 'Александр', 'Васильев', 'MT-102', 1),
(60, 'Константин', 'Васильев', 'MT-102', 1),
(61, 'Полина', 'Вешнякова', 'MT-102', 1),
(62, 'Иван', 'Виноградов', 'MT-102', 1),
(63, 'Варвара', 'Виноградова', 'MT-102', 1),
(64, 'Даниил', 'Вишневский', 'MT-102', 1),
(65, 'Иван', 'Владимиров', 'MT-102', 1),
(66, 'Матвей', 'Власов', 'MT-102', 1),
(67, 'Анастасия', 'Волкова', 'MT-102', 1),
(68, 'Тимур', 'Воробьев', 'MT-102', 1),
(69, 'Дарья', 'Воробьева', 'MT-102', 1),
(70, 'Фёдор', 'Гаврилов', 'MT-102', 1),
(71, 'Илья', 'Галкин', 'MT-102', 1),
(72, 'Евгений', 'Галкин', 'MT-102', 1),
(73, 'Егор', 'Герасимов', 'MT-102', 1),
(74, 'Кирилл', 'Горбачев', 'MT-102', 1),
(75, 'Мария', 'Грачева', 'MT-102', 1),
(76, 'Владимир', 'Греков', 'MT-102', 1),
(77, 'Виктория', 'Григорьева', 'MT-102', 1),
(78, 'Мария', 'Гурова', 'MT-102', 1),
(79, 'Михаил', 'Гусев', 'MT-102', 1),
(80, 'Артём', 'Гусев', 'MT-102', 1),
(81, 'Мирослава', 'Давыдова', 'MT-102', 1),
(82, 'Лилия', 'Денисова', 'MT-102', 1),
(83, 'Арина', 'Дмитриева', 'MT-102', 1),
(84, 'Анна', 'Дмитриева', 'MП-101', 1),
(85, 'Лука', 'Дорофеев', 'MП-101', 1),
(86, 'Виктор', 'Дорофеев', 'MП-101', 1),
(87, 'Даниил', 'Егоров', 'MП-101', 1),
(88, 'Артём', 'Егоров', 'MП-101', 1),
(89, 'Николай', 'Емельянов', 'MП-101', 1),
(90, 'Семён', 'Ермаков', 'MП-101', 1),
(91, 'Денис', 'Жуков', 'MП-101', 1),
(92, 'Алина', 'Жукова', 'MП-101', 1),
(93, 'Борис', 'Журавлев', 'MП-101', 1),
(94, 'Иван', 'Завьялов', 'MП-101', 1),
(95, 'Виктория', 'Звягинцева', 'MП-101', 1),
(96, 'Иван', 'Зиновьев', 'MП-101', 1),
(97, 'Варвара', 'Зубова', 'MП-101', 1),
(98, 'Святослав', 'Иванов', 'MП-101', 1),
(99, 'Михаил', 'Иванов', 'MП-101', 1),
(100, 'Александр', 'Иванов', 'MП-101', 1),
(101, 'Дмитрий', 'Иванов', 'MП-101', 1),
(102, 'Андрей', 'Иванов', 'MП-101', 1),
(103, 'Савва', 'Иванов', 'MП-101', 1),
(104, 'Майя', 'Иванова', 'MП-101', 1),
(105, 'Варвара', 'Иванова', 'MП-101', 1),
(106, 'Александра', 'Иванова', 'MП-101', 1),
(107, 'Валерия', 'Иванова', 'MП-101', 1),
(108, 'Ева', 'Измайлова', 'MП-101', 1),
(109, 'Илья', 'Ильин', 'MП-102', 1),
(110, 'Евгений', 'Казаков', 'MП-102', 1),
(111, 'Владислав', 'Калачев', 'MП-102', 1),
(112, 'Дмитрий', 'Калинин', 'MП-102', 1),
(113, 'Алиса', 'Калинина', 'MП-102', 1),
(114, 'Александра', 'Колесникова', 'MП-102', 1),
(115, 'Александра', 'Комарова', 'MП-102', 1),
(116, 'Мирон', 'Константинов', 'MП-102', 1),
(117, 'Василий', 'Королев', 'MП-102', 1),
(118, 'Варвара', 'Королева', 'MП-102', 1),
(119, 'Виктория', 'Короткова', 'MП-102', 1),
(120, 'Мирослава', 'Котова', 'MП-102', 1),
(121, 'Алиса', 'Крючкова', 'MП-102', 1),
(122, 'Анна', 'Кудрявцева', 'MП-102', 1),
(123, 'Тимур', 'Кузнецов', 'MП-102', 1),
(124, 'Надежда', 'Кузнецова', 'MП-102', 1),
(125, 'Сергей', 'Кузьмин', 'MП-102', 1),
(126, 'Михаил', 'Куликов', 'MП-102', 1),
(127, 'Мария', 'Куликова', 'MП-102', 1),
(128, 'Степан', 'Лазарев', 'MП-102', 1),
(129, 'Мария', 'Лапина', 'MП-102', 1),
(130, 'Кирилл', 'Ларионов', 'MП-102', 1),
(131, 'Даниил', 'Лебедев', 'MП-102', 1),
(132, 'Дарья', 'Лебедева', 'MП-102', 1),
(133, 'Максим', 'Леонтьев', 'MП-102', 1),
(134, 'Кирилл', 'Лукин', 'MН-101', 1),
(135, 'Георгий', 'Лыков', 'MН-101', 1),
(136, 'Михаил', 'Макаров', 'MН-101', 1),
(137, 'Максим', 'Макаров', 'MН-101', 1),
(138, 'Вероника', 'Макарова', 'MН-101', 1),
(139, 'Николай', 'Малышев', 'MН-101', 1),
(140, 'Виктория', 'Маркова', 'MН-101', 1),
(141, 'Анна', 'Мартынова', 'MН-101', 1),
(142, 'Максим', 'Маслов', 'MН-101', 1),
(143, 'Ксения', 'Матвеева', 'MН-101', 1),
(144, 'Мария', 'Матвеева', 'MН-101', 1),
(145, 'София', 'Матвеева', 'MН-101', 1),
(146, 'Кирилл', 'Медведев', 'MН-101', 1),
(147, 'Елизавета', 'Мещерякова', 'MН-101', 1),
(148, 'Алиса', 'Минаева', 'MН-101', 1),
(149, 'Елена', 'Миронова', 'MН-101', 1),
(150, 'Матвей', 'Моисеев', 'MН-101', 1),
(151, 'Дарья', 'Моисеева', 'MН-101', 1),
(152, 'Виктор', 'Молчанов', 'MН-101', 1),
(153, 'Ксения', 'Молчанова', 'MН-101', 1),
(154, 'Лука', 'Морозов', 'MН-101', 1),
(155, 'Александра', 'Муравьева', 'MН-101', 1),
(156, 'Артём', 'Некрасов', 'MН-101', 1),
(157, 'София', 'Никитина', 'MН-101', 1),
(158, 'Кристина', 'Никифорова', 'MН-101', 1),
(159, 'Арина', 'Николаева', 'MН-102', 1),
(160, 'Ева', 'Николаева', 'MН-102', 1),
(161, 'Мирослава', 'Никонова', 'MН-102', 1),
(162, 'Тимофей', 'Новиков', 'MН-102', 1),
(163, 'Михаил', 'Орлов', 'MН-102', 1),
(164, 'Екатерина', 'Орлова', 'MН-102', 1),
(165, 'Александра', 'Орлова', 'MН-102', 1),
(166, 'Степан', 'Павлов', 'MН-102', 1),
(167, 'Тимур', 'Панов', 'MН-102', 1),
(168, 'Илья', 'Пантелеев', 'MН-102', 1),
(169, 'Дарина', 'Петрова', 'MН-102', 1),
(170, 'Василиса', 'Петрова', 'MН-102', 1),
(171, 'Василиса', 'Петрова', 'MН-102', 1),
(172, 'Ульяна', 'Платонова', 'MН-102', 1),
(173, 'София', 'Плотникова', 'MН-102', 1),
(174, 'Николай', 'Поляков', 'MН-102', 1),
(175, 'Никита', 'Пономарев', 'MН-102', 1),
(176, 'Вера', 'Пономарева', 'MН-102', 1),
(177, 'Марина', 'Попова', 'MН-102', 1),
(178, 'Кристина', 'Ракова', 'MН-102', 1),
(179, 'Кира', 'Рубцова', 'MН-102', 1),
(180, 'Максим', 'Румянцев', 'MН-102', 1),
(181, 'Алиса', 'Русакова', 'MН-102', 1),
(182, 'Тимофей', 'Самсонов', 'MН-102', 1),
(183, 'Алиса', 'Севастьянова', 'MН-102', 1),
(184, 'Алиса', 'Селиванова', 'MК-101', 1),
(185, 'Анастасия', 'Семенова', 'MК-101', 1),
(186, 'Александр', 'Серов', 'MК-101', 1),
(187, 'Кирилл', 'Симонов', 'MК-101', 1),
(188, 'Георгий', 'Смирнов', 'MК-101', 1),
(189, 'Павел', 'Смирнов', 'MК-101', 1),
(190, 'Виктория', 'Соколова', 'MК-101', 1),
(191, 'Анна', 'Соколова', 'MК-101', 1),
(192, 'Адам', 'Соловьев', 'MК-101', 1),
(193, 'Илья', 'Соловьев', 'MК-101', 1),
(194, 'Юрий', 'Степанов', 'MК-101', 1),
(195, 'Мария', 'Степанова', 'MК-101', 1),
(196, 'Полина', 'Степанова', 'MК-101', 1),
(197, 'Валерия', 'Степанова', 'MК-101', 1),
(198, 'Анна', 'Степанова', 'MК-101', 1),
(199, 'Алиса', 'Суслова', 'MК-101', 1),
(200, 'Ангелина', 'Суханова', 'MК-101', 1),
(201, 'Артур', 'Сычев', 'MК-101', 1),
(202, 'Виктор', 'Тарасов', 'MК-101', 1),
(203, 'Вера', 'Тарасова', 'MК-101', 1),
(204, 'Игорь', 'Терентьев', 'MК-101', 1),
(205, 'Алиса', 'Тимофеева', 'MК-101', 1),
(206, 'Ульяна', 'Тимофеева', 'MК-101', 1),
(207, 'Николай', 'Титов', 'MК-101', 1),
(208, 'Дмитрий', 'Трошин', 'MК-101', 1),
(209, 'Михаил', 'Ушаков', 'MК-102', 1),
(210, 'Валерия', 'Ушакова', 'MК-102', 1),
(211, 'Ярослав', 'Федоров', 'MК-102', 1),
(212, 'Дарья', 'Федосеева', 'MК-102', 1),
(213, 'Артём', 'Федотов', 'MК-102', 1),
(214, 'Роман', 'Филиппов', 'MК-102', 1),
(215, 'Фёдор', 'Филиппов', 'MК-102', 1),
(216, 'Мария', 'Филиппова', 'MК-102', 1),
(217, 'Екатерина', 'Филиппова', 'MК-102', 1),
(218, 'Вадим', 'Фокин', 'MК-102', 1),
(219, 'Лев', 'Фомин', 'MК-102', 1),
(220, 'Алёна', 'Фомина', 'MК-102', 1),
(221, 'Егор', 'Фролов', 'MК-102', 1),
(222, 'Анна', 'Фролова', 'MК-102', 1),
(223, 'Платон', 'Хохлов', 'MК-102', 1),
(224, 'Платон', 'Чернов', 'MК-102', 1),
(225, 'Виктория', 'Чернова', 'MК-102', 1),
(226, 'Анастасия', 'Чернова', 'MК-102', 1),
(227, 'Александр', 'Шаповалов', 'MК-102', 1),
(228, 'Мария', 'Шишкина', 'MК-102', 1),
(229, 'Дарина', 'Щербакова', 'MК-102', 1),
(230, 'Артур', 'Яковлев', 'MК-102', 1),
(231, 'Яна', 'Яковлева', 'MК-102', 1),
(232, 'Екатерина', 'Яковлева', 'MК-102', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id` int NOT NULL,
  `email` varchar(180) COLLATE utf8mb4_unicode_ci NOT NULL,
  `login` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `roles` json NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `email`, `login`, `name`, `roles`, `password`) VALUES
(3, 'admin@mail.ru', 'default', 'default', '[]', 'iLzpMwNBBI+cFeMr2RL2bQ=='),
(4, 'qwerty@mail.ru', 'default', 'default', '[]', '0YJNRZ1EaZsIPS2jANJyNg=='),
(5, 'testuser123@mail.com', 'default', 'default', '[]', 'V8UXbCHzSu9KAhoX9I3NXQ=='),
(6, 'zzzzzzzz@mail.ru', 'default', 'default', '[]', 'OSPBIpkWnIFu4MvM5dVPbg=='),
(7, '123@mail.ru', 'default', 'default', '[]', 'Mj4eT+827HYG5qGyTxm8qg==');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `doctrine_migration_versions`
--
ALTER TABLE `doctrine_migration_versions`
  ADD PRIMARY KEY (`version`);

--
-- Индексы таблицы `order`
--
ALTER TABLE `order`
  ADD PRIMARY KEY (`id`),
  ADD KEY `student_id` (`student_id`);

--
-- Индексы таблицы `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `UNIQ_8D93D649E7927C74` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `order`
--
ALTER TABLE `order`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT для таблицы `student`
--
ALTER TABLE `student`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=233;

--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `order`
--
ALTER TABLE `order`
  ADD CONSTRAINT `order_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `student` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
